In [3]:
# 주피터 노트북 구버전
from IPython.display import display, HTML
display(HTML("""
<style>
div.container{width:97% !important;}
div.CodeMirror {font-family:Consolas; font-size:22pt;}
div.output {font-size:22pt; font-weight:bold;}
div.input {font-family:Consolas; font-size:22pt;}
div.prompt {min-width:70px;}
</style>
"""))

In [3]:
# 주피터 노트북 새버전
from IPython.display import display, HTML
display(HTML("""
<style>
div.jp-WindowedPanel-outer.lm-Widget{padding:5px;}
div.lm-Widget{font-size:19pt;}
div.cm-content {font-family:Consolas; font-size:19pt;}
div.jp-OutputArea-output pre {font-size:19pt; font-weight:bold;}
input.jp-Stdin-input {font-family:Consolas; font-size:19pt;}
td,th{font-size:15pt;}
</style>
"""))

<font size="8" color="red"><b>ch10. Pandas (데이터프레임, 시리즈)</b></font>
- pip install pandas (cmd창에서 실행)

# 1절. 판다스 패키지
- 데이터 분석을 위한 반드시 알아야 할 패키지. 넘파이를 기반으로 하며, 다른 라이브러리와 잘 통합되어 설계
- 1차원 구조를 갖는 시리즈, 2차원 구조를 갖는 데이터프레임을 제공
- 결측치처리, 크기변경(열삭제/추가, 행삭제/추가), 데이터정렬, 데이터분할/병합, 통계처리, 부분데이터추출, 파일입출력, 레이블링, 시각화용이, ....

In [5]:
import pandas as pd
pd.__version__

'2.1.4'

In [6]:
data = pd.read_json('data/ch10_member1.json', encoding="CP949") # 디폴트가 UTF-8
print(type(data))
data

<class 'pandas.core.frame.DataFrame'>

  name  age          email address
0  홍길동   20  hong@hong.com      서울
1  김김김   25   kim@hong.com      경기
2  박길동   30  park@hong.com      제주

In [9]:
data = pd.read_json('data/ch10_member2.json') # UTF-8로 read
data

  name  age          email address
0  홍길동   20  hong@hong.com      서울
1  김김김   25   kim@hong.com      경기
2  박길동   30  park@hong.com      제주

In [10]:
member1 = pd.read_csv('data/ch09_member1.csv', header=None,
                     names=['name','age','email','address'],
                     encoding="utf-8") # encoding="utf-8" 기본값이라 생략가능
member1

  name  age          email  address
0  홍길동   20  hong@hong.com  서울시 강동구
1  박길서   33  park@hong.com  서울시 강서구
2  박길남   23   gil@hong.com  서울시 강남구
3  김길북   20   kim@hong.com  서울시 강북구
4  신길서   40  park@hong.com  서울시 강서구
5  신길동   28  park@hong.com  서울시 강서동

# 2절. 데이터프레임 만들기
## 2.1 딕션너리를 이용해서 데이터프레임 만들기

In [12]:
d = {'name':['홍길동','신길동'], 'age':[20,30]}
df = pd.DataFrame(data=d)
df

  name  age
0  홍길동   20
1  신길동   30

## 2.2 리스트를 이용하여 데이터 프레임 만들기

In [13]:
d = [{'name':'홍길동', 'age':20} ,  {'name':'신길동', 'age':30}]
df = pd.DataFrame(data=d)
df

  name  age
0  홍길동   20
1  신길동   30

## 2.3 read_csv()

In [16]:
df = pd.read_csv('data/전국 평균 평당 분양가격(2013년 9월부터 2015년 8월까지).csv',
                encoding="CP949")
df.shape # 행, 열

(17, 22)

In [18]:
df.head(2) # 상위2줄

,지역,2013년12월,2014년1월,2014년2월,2014년3월,2014년4월,2014년5월,2014년6월,2014년7월,2014년8월,...,2014년11월,2014년12월,2015년1월,2015년2월,2015년3월,2015년4월,2015년5월,2015년6월,2015년7월,2015년8월
0,서울,18189,17925,17925,18016,18098,19446,18867,18742,19274,...,20242,20269,20670,20670,19415,18842,18367,18374,18152,18443
1,부산,8111,8111,9078,8965,9402,9501,9453,9457,9411,...,9208,9208,9204,9235,9279,9327,9345,9515,9559,9581

In [19]:
pd.options.display.max_columns # 최대 데이터프레임의 표현될 수 있는 열 수

20

In [20]:
pd.options.display.max_columns = 22
df.sample()

,지역,2013년12월,2014년1월,2014년2월,2014년3월,2014년4월,2014년5월,2014년6월,2014년7월,2014년8월,2014년9월,2014년10월,2014년11월,2014년12월,2015년1월,2015년2월,2015년3월,2015년4월,2015년5월,2015년6월,2015년7월,2015년8월
12,전북,6282,6281,5946,5966,6277,6306,6351,6319,6436,6719,6581,6583,6583,6583,6583,6542,6551,6556,6601,6750,6580

## 2.4 sklearn, statsmodels, searborn 등의 라이브러리에서 데이터프레임 불러오기

In [23]:
import statsmodels.api as sm
iris = sm.datasets.get_rdataset("iris", package="datasets").data
iris.tail() # 끝 5행

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

# 3절. 이름(열, 행) 지정하기

In [25]:
member_df = pd.read_csv('data/ch09_member1.csv', header=None)
member_df

     0   1              2        3
0  홍길동  20  hong@hong.com  서울시 강동구
1  박길서  33  park@hong.com  서울시 강서구
2  박길남  23   gil@hong.com  서울시 강남구
3  김길북  20   kim@hong.com  서울시 강북구
4  신길서  40  park@hong.com  서울시 강서구
5  신길동  28  park@hong.com  서울시 강서동

In [27]:
# 열이름 지정하기
member_df.columns = ['name','age','email','address']
member_df

  name  age          email  address
0  홍길동   20  hong@hong.com  서울시 강동구
1  박길서   33  park@hong.com  서울시 강서구
2  박길남   23   gil@hong.com  서울시 강남구
3  김길북   20   kim@hong.com  서울시 강북구
4  신길서   40  park@hong.com  서울시 강서구
5  신길동   28  park@hong.com  서울시 강서동

In [28]:
member_df = pd.concat([member_df, member_df])
member_df

  name  age          email  address
0  홍길동   20  hong@hong.com  서울시 강동구
1  박길서   33  park@hong.com  서울시 강서구
2  박길남   23   gil@hong.com  서울시 강남구
3  김길북   20   kim@hong.com  서울시 강북구
4  신길서   40  park@hong.com  서울시 강서구
5  신길동   28  park@hong.com  서울시 강서동
0  홍길동   20  hong@hong.com  서울시 강동구
1  박길서   33  park@hong.com  서울시 강서구
2  박길남   23   gil@hong.com  서울시 강남구
3  김길북   20   kim@hong.com  서울시 강북구
4  신길서   40  park@hong.com  서울시 강서구
5  신길동   28  park@hong.com  서울시 강서동

In [29]:
member_df.index

Index([0, 1, 2, 3, 4, 5, 0, 1, 2, 3, 4, 5], dtype='int64')

In [31]:
member_df.index = ['동','서','남','북','중','신']*2
member_df

  name  age          email  address
동  홍길동   20  hong@hong.com  서울시 강동구
서  박길서   33  park@hong.com  서울시 강서구
남  박길남   23   gil@hong.com  서울시 강남구
북  김길북   20   kim@hong.com  서울시 강북구
중  신길서   40  park@hong.com  서울시 강서구
신  신길동   28  park@hong.com  서울시 강서동
동  홍길동   20  hong@hong.com  서울시 강동구
서  박길서   33  park@hong.com  서울시 강서구
남  박길남   23   gil@hong.com  서울시 강남구
북  김길북   20   kim@hong.com  서울시 강북구
중  신길서   40  park@hong.com  서울시 강서구
신  신길동   28  park@hong.com  서울시 강서동

In [32]:
member_df.index = range(len(member_df))
member_df

   name  age          email  address
0   홍길동   20  hong@hong.com  서울시 강동구
1   박길서   33  park@hong.com  서울시 강서구
2   박길남   23   gil@hong.com  서울시 강남구
3   김길북   20   kim@hong.com  서울시 강북구
4   신길서   40  park@hong.com  서울시 강서구
5   신길동   28  park@hong.com  서울시 강서동
6   홍길동   20  hong@hong.com  서울시 강동구
7   박길서   33  park@hong.com  서울시 강서구
8   박길남   23   gil@hong.com  서울시 강남구
9   김길북   20   kim@hong.com  서울시 강북구
10  신길서   40  park@hong.com  서울시 강서구
11  신길동   28  park@hong.com  서울시 강서동

In [36]:
# name을 행이름
# memer_df = member_df.set_index("name") #  inplace=False 적용된 내용 return
member_df.set_index("name", inplace=True) #  inplace=True 데이터프레임에 적용
member_df

      age          email  address
name
홍길동    20  hong@hong.com  서울시 강동구
박길서    33  park@hong.com  서울시 강서구
박길남    23   gil@hong.com  서울시 강남구
김길북    20   kim@hong.com  서울시 강북구
신길서    40  park@hong.com  서울시 강서구
신길동    28  park@hong.com  서울시 강서동
홍길동    20  hong@hong.com  서울시 강동구
박길서    33  park@hong.com  서울시 강서구
박길남    23   gil@hong.com  서울시 강남구
김길북    20   kim@hong.com  서울시 강북구
신길서    40  park@hong.com  서울시 강서구
신길동    28  park@hong.com  서울시 강서동

In [41]:
# 행이름을 컬럼에 편입시키디
# member_df = member_df.reset_index() # reset 적용한 것을 return
member_df.reset_index(inplace=True)   # reset을 member_df에 적용
member_df

    level_0  index name  age          email  address
0         0      0  홍길동   20  hong@hong.com  서울시 강동구
1         1      1  박길서   33  park@hong.com  서울시 강서구
2         2      2  박길남   23   gil@hong.com  서울시 강남구
3         3      3  김길북   20   kim@hong.com  서울시 강북구
4         4      4  신길서   40  park@hong.com  서울시 강서구
5         5      5  신길동   28  park@hong.com  서울시 강서동
6         6      6  홍길동   20  hong@hong.com  서울시 강동구
7         7      7  박길서   33  park@hong.com  서울시 강서구
8         8      8  박길남   23   gil@hong.com  서울시 강남구
9         9      9  김길북   20   kim@hong.com  서울시 강북구
10       10     10  신길서   40  park@hong.com  서울시 강서구
11       11     11  신길동   28  park@hong.com  서울시 강서동

In [43]:
name = member_df['name'] # 시리즈
print(type(name))
name

<class 'pandas.core.series.Series'>

0     홍길동
1     박길서
2     박길남
3     김길북
4     신길서
5     신길동
6     홍길동
7     박길서
8     박길남
9     김길북
10    신길서
11    신길동
Name: name, dtype: object

In [46]:
member = member_df.loc[0] # 0번 인덱스 행 => 시리즈
print(type(member))
member

<class 'pandas.core.series.Series'>

level_0                0
index                  0
name                 홍길동
age                   20
email      hong@hong.com
address          서울시 강동구
Name: 0, dtype: object

In [47]:
member_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   level_0  12 non-null     int64
 1   index    12 non-null     int64
 2   name     12 non-null     object
 3   age      12 non-null     int64
 4   email    12 non-null     object
 5   address  12 non-null     object
dtypes: int64(3), object(3)
memory usage: 708.0+ bytes

In [50]:
member_df['age'] = member_df['age'].astype('float64') # 데이터 프레임의 열의 타입을 변경

In [51]:
member_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   level_0  12 non-null     int64
 1   index    12 non-null     int64
 2   name     12 non-null     object
 3   age      12 non-null     float64
 4   email    12 non-null     object
 5   address  12 non-null     object
dtypes: float64(1), int64(2), object(3)
memory usage: 708.0+ bytes

# 4절. 부분 데이터 조회
- 특정열, 특정행, 특정행의 특정열, 특정조건의 행 모든열, 특정조건의 행의 특정열

In [5]:
import pandas as pd
member = pd.read_csv('data/ch09_member2.csv')
member

  name  age          email  address
0  홍길동   20  hong@hong.com  서울시 강동구
1  박길서   33  park@hong.com  부산시 강서구
2  박길남   23   gil@hong.com  서울시 강남구
3  김길북   20   kim@hong.com  서울시 강북구
4  신길서   40  park@hong.com  서울시 강서구
5  신길동   28  park@hong.com  서울시 강서동